modules/mediaplayer/controllers/WpController.php

    public function actionChannels(){
      if ($this->checkPublicPermission()){
          $channels = Channel::find()->orderBy('name ASC')->all();
---
SELECT * FROM `channel` ORDER BY `name`

    public function actionAlbums(){
      if ($this->checkPublicPermission()){
          $id = Yii::$app->request->get('id');
          $channel = Channel::find()->with('albums.artists')->where(['id' => $id])->one();
---
SELECT * FROM `album` WHERE `id` IN ('1', '2', '3', '4')
SELECT * FROM `artist` WHERE `id` IN ('6', '7', '8', '9')
SELECT * FROM `channel` WHERE `id`='14'

    public function actionThumbnail(){
      if ($this->checkPublicPermission()){
        $id = Yii::$app->request->get('id');

        $album =  Album::findOne($id);
---
SELECT * FROM `album` WHERE `id`='4'

    public function actionSongs(){
        if ($this->checkPublicPermission()){
            $id = Yii::$app->request->get('id');

            $album = Album::find()->with('songs')->where(['id' => $id])->one();
---
SELECT * FROM `album` WHERE `id`='1'
SELECT * FROM `song` WHERE `album_id`=1